emacs/init.org
;-*- eval: (load-file "./init-dev.el");   -*-
#+title: Emacs config
#+property: header-args :mkdirp yes :tangle yes :tangle-mode: #o444 :results silent :noweb yes
#+startup: content

* TODO early-init
:PROPERTIES:
:header-args: :tangle-mode o444 :results silent :tangle ~/.config/emacs/early-init.el
:END:
#+begin_src emacs-lisp :lexical t
;;; early-init.el --- Emacs pre package.el & GUI configuration -*- lexical-binding: t; -*-
;;; Code:
#+end_src

#+begin_src emacs-lisp :lexical t
(setq package-enable-at-startup nil)
(setq inhibit-default-init nil)
#+end_src

#+begin_src emacs-lisp :lexical t
(setq native-comp-async-report-warnings-errors nil)
;; (debug-on-entry 'emacs-repository-branch-git)
;; (debug-on-entry 'emacs-repository-version-git)
#+end_src
** Debugging 
Running this form will launch the debugger after loading a package.
This is useful for finding out when a dependency is requiring a package (perhaps earlier than you want).
Use by tangling this block and launching Emacs with =emacs --debug-init=.

#+begin_src emacs-lisp :var file="" :results silent :tangle no
(unless (string-empty-p file)
  (eval-after-load file
    '(debug)))
#+end_src

Similarly, this variable will hit the debugger when a message matches its regexp.
#+begin_src emacs-lisp :tangle no
(setq debug-on-message "")
#+end_src

Adding a variable watcher can be a useful way to track down initialization and mutation of a variable.
#+begin_src emacs-lisp :tangle no
(add-variable-watcher 'org-capture-after-finalize-hook
                      (lambda (symbol newval operation where)
                        (debug)
                        (message "%s set to %s" symbol newval)))
#+end_src

#+begin_src emacs-lisp :tangle no
(setq debug-on-error t)
#+end_src

** Оптимизация file-name-handler-alist
Пропуск  регулярных выражений в  =file-name-handler-alist= .  
#+begin_src emacs-lisp :lexical t
(defvar default-file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)
#+end_src
** TODO Папка с кешем
#+begin_src emacs-lisp :lexical t
(when (boundp 'native-comp-eln-load-path)
  (setcar native-comp-eln-load-path
          (expand-file-name "cache/eln-cache/" user-emacs-directory)))
#+end_src

** Настройка Garbage Collection

#+begin_src emacs-lisp :lexical t 
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 1)

(defun +gc-after-focus-change ()
  "Run GC when frame loses focus."
  (run-with-idle-timer
   5 nil
   (lambda () (unless (frame-focus-state) (garbage-collect)))))
#+end_src

#+begin_src emacs-lisp :lexical t 
(defun +reset-init-values ()
  (run-with-idle-timer
   1 nil
   (lambda ()
     (setq file-name-handler-alist default-file-name-handler-alist
           gc-cons-percentage 0.1
           gc-cons-threshold 100000000)
     (message "gc-cons-threshold & file-name-handler-alist restored")
     (when (boundp 'after-focus-change-function)
       (add-function :after after-focus-change-function #'+gc-after-focus-change)))))

(with-eval-after-load 'elpaca
  (add-hook 'elpaca-after-init-hook '+reset-init-values))
#+end_src

** TODO Преднастройка ui и некоторый тюнинг. 
*** TODO Это должно быть тут ?
Увеличивает время запуска. Здесь не надо указывать. 
#+begin_src emacs-lisp :lexical t
;; (setq read-process-output-max (* 64 1024))  ; 64kb
#+end_src
*** Отключаем tool-bar, menu-bar, vertical-scroll
#+begin_src emacs-lisp :lexical t
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
#+end_src

*** Отключаем инструкции как закрывать emacsclient
#+begin_src emacs-lisp :lexical t
(setq server-client-instructions nil)
#+end_src
*** Не менять размер фрейма в зависимости от шрифтов
+к времени запуска если nil 
#+begin_src emacs-lisp :lexical t
(setq frame-inhibit-implied-resize t)
#+end_src
*** Игнорирование настроек в  Xresources
#+begin_src emacs-lisp :lexical t
(advice-add #'x-apply-session-resources :override #'ignore)
#+end_src

*** Фикс  бага ?
Taken from:

[[https://github.com/vsemyonoff/emacsrc/blob/14649a5bafea99cc7e13e7d048e9d15aed7926ce/early-init.el]]

This helps with a bug I was hitting when using =desktop-save-mode='s =desktop-read=.
#+begin_src emacs-lisp :lexical t
(setq desktop-restore-forces-onscreen nil)
#+end_src

*** Шрифты 

#+begin_src emacs-lisp :lexical t
;;(push '(font . "PT Serif") default-frame-alist)


;; (push '(font . "JetBrainsMono Nerd Font") default-frame-alist)
;; (set-face-font 'default "JetBrainsMono Nerd Font")
(push '(font . "JetBrains Mono") default-frame-alist)
(set-face-font 'default "JetBrains Mono")
(set-face-font 'variable-pitch "IBM Plex Serif")
(copy-face 'default 'fixed-pitch)

;; emoji without VARIATION SELECTOR-16 (U+FE0F)
;; (set-fontset-font t 'unicode "Noto Color Emoji" nil 'prepend)
#+end_src
*** Отключаем функцию звонка
#+begin_src emacs-lisp :lexical t
(setq ring-bell-function #'ignore
      inhibit-startup-screen t)
#+end_src

#+begin_src emacs-lisp :lexical t
(provide 'early-init)
;;; early-init.el ends here
#+end_src

* lexical binding. начало init.el
#+begin_src emacs-lisp :lexical t
;; -*- lexical-binding: t; -*-
#+end_src
* Профилирование 
** Проверки времени запуска
#+begin_src emacs-lisp :lexical t
(add-hook 'elpaca-after-init-hook
          (lambda ()
            (message "Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract (current-time) before-init-time)))
                     gcs-done)))
#+end_src

** Запуск profilling 
#+begin_src emacs-lisp :lexical t :tangle no
(profiler-start 'cpu+mem)
(add-hook 'elpaca-after-init-hook (lambda () (profiler-stop) (profiler-report)))
#+end_src
** Поиск "горячих" функций 
ELP полезен для поиска горячих функций
#+begin_src emacs-lisp :var file="elpaca" :lexical t :tangle no
(require 'elp)
(with-eval-after-load file
  (elp-instrument-package file))
(add-hook 'elpaca-after-init-hook
          (lambda () (elp-results) (elp-restore-package (intern file))))
#+end_src
* Стартовый буфер initial-buffer-choice
#+begin_src emacs-lisp :lexical t
(setq initial-buffer-choice t) ;;*scratch*
#+end_src
* Пример хранения тем в отдельной директории. 
=~/.emacs.d=
#+begin_src emacs-lisp :lexical t :tangle no
(setq custom-theme-directory "~/.emacs.d/themes/")
#+end_src

#+begin_src emacs-lisp :lexical t :tangle no
(defvar +theme 'mine "Default theme.")
(require 'cl-lib)
(require 'custom)
;; remove synthetic use-package theme
(unless (remq 'use-package custom-enabled-themes) (load-theme +theme t))
#+end_src

* Elpaca настройка
** Основные настройки elpaca
#+begin_src emacs-lisp :lexical t
(defvar elpaca-installer-version 0.11)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
(setq elpaca-queue-limit 30)
#+end_src

** keychain (?)
[[https://www.funtoo.org/Keychain][Keychain]] 
#+begin_src emacs-lisp :lexical t :tangle no
;; We need this loaded for SSH protocol
(elpaca-queue
 (elpaca keychain-environment
   (require 'keychain-environment)
   (keychain-refresh-environment)))
#+end_src
** Макрос use-feature с :ensure nil для built-in пакетов.
#+begin_src emacs-lisp :lexical t
(defmacro use-feature (name &rest args)
  "Like `use-package' but accounting for asynchronous installation.
  NAME and ARGS are in `use-package'."
  (declare (indent defun))
  `(use-package ,name
     :ensure nil
     ,@args))
#+end_src
** use-package всегда :ensure t
#+begin_src emacs-lisp :lexical t
(elpaca elpaca-use-package
  (require 'elpaca-use-package)
  (elpaca-use-package-mode)
  (setq use-package-always-ensure t))
#+end_src

#+begin_src emacs-lisp :lexical t
(elpaca-wait)
#+end_src
** настрока debug 
#+begin_src emacs-lisp :lexical t
(if debug-on-error
    (setq use-package-verbose t
          use-package-expand-minimally nil
          use-package-compute-statistics t)
  (setq use-package-verbose nil
        use-package-expand-minimally t))
#+end_src
** Директории с личным пакетами 
#+begin_src emacs-lisp :lexical t
(let ((default-directory "~/.config/emacs/lisp"))
  (when (file-exists-p default-directory)
    (normal-top-level-add-to-load-path '("."))
    (normal-top-level-add-subdirs-to-load-path)))
#+end_src
Под notmuch 
на Void Linux  ~/usr/share/emacs/site-lisp/notmuch~ 
#+begin_src emacs-lisp :lexical t

(let ((additional-paths '("/usr/share/emacs/site-lisp/notmuch"))) 
  (mapc (lambda (path)
          (when (file-directory-p path) 
            (add-to-list 'load-path path)))
        additional-paths))
#+end_src

* literate
#+begin_src emacs-lisp :lexical t
(setq literate-file (concat user-emacs-directory "init.org"))
#+end_src
* terminal utf-8
#+begin_src emacs-lisp :lexical t
(defun +terminal ()
  "Set the terimnal coding system."
  (unless (display-graphic-p)
    (set-terminal-coding-system 'utf-8)))

(add-hook 'server-after-make-frame-hook #'+terminal)
#+end_src
* Файл с секретами
#+begin_src emacs-lisp :lexical t :tangle no
(load-file "~/Documents/emacs-secrets.el")
#+end_src
* General.el 
#+begin_src emacs-lisp :lexical t
(use-package general
  :ensure (:wait t)
  :demand t
  :config
  (general-override-mode)
  (general-auto-unbind-keys)
#+end_src
** config
